/*
별헤는밤
윤동주

季節계절이 지나가는 하늘에는
가을로 가득 차있습니다。

나는 아무 걱정도 없이
가을속의 별들을 다 헤일듯합니다。

가슴속에 하나 둘 색여지는 별을
이제 다 못헤는것은
쉬이 아츰이 오는 까닭이오、
來日내일밤이 남은 까닭이오、
아직 나의 靑春청춘이 다하지 않은 까닭입니다。

별 하나에 追憶추억과
별 하나에 사랑과
별 하나에 쓸쓸함과
별 하나에 憧憬동경과
별 하나에 詩시와
별 하나에 어머니、어머니、

어머님、나는 별 하나에 아름다운 말 한마디식 불러봅니다。 小學校소학교 때 冊床책상을 같이 햇든 아이들의 일홈과 佩패、鏡경、玉옥 이런 異國少女이국소녀들의 일홈과 벌서 애기 어마니 된 게집애들의 일홈과、가난한 이웃사람들의 일홈과、비둘기、강아지、토끼、노새、노루、｢프랑시스·자｣ ｢라이너·마리아·릴케｣ 이런 詩人시인의 일홈을 불러봅니다。

이네들은 너무나 멀리 있습니다。
별이 아슬이 멀듯이、

어머님、
그리고 당신은 멀리 北間島북간도에 게십니다。

나는 무엇인지 그러워
이많은 별빛이 나린 언덕우에
내 일홈자를 써보고、
흙으로 덥허 버리엿습니다。

따는 밤을 새워 우는 버레는
부끄러운 일홈을 슬퍼하는 까닭입니다。
(一九四一、十一、五.)

그러나 겨을이 지나고 나의별에도 봄이 오면
무덤우에 파란 잔디가 피여나듯이
내일홈자 묻힌 언덕우에도
자랑처럼 풀이 무성 할게외다。







서시
윤동주

죽는 날까지 하늘을 우러러
한 점 부끄럼이 없기를,
잎새에 이는 바람에도
나는 괴로워했다.
별을 노래하는 마음으로
모든 죽어 가는 것을 사랑해야지
그리고 나한테 주어진 길을
걸어가야겠다.

오늘 밤에도 별이 바람에 스치운다.







自畵像
윤동주

산모퉁이를 돌아 논가 외딴 우물을 홀로 찾아가선 가만히 들여다봅니다。

우물 속에는 달이 밝고 구름이 흐르고 하늘이 펼치고 파아란 바람이 불고 가을이 있습니다。

그리고 한 사나이가 있습니다。

어쩐지 그 사나이가 미워져 돌아갑니다。

돌아가다 생각하니 그 사나이가 가엾어집니다。 도로 가 들여다보니 사나이는 그대로 있습니다。

다시 그 사나이가 미워져 돌아갑니다。

돌아가다 생각하니 그 사나이가 그리워집니다。

우물 속에는 달이 밝고 구름이 흐르고 하늘이 펼치고 파아란 바람이 불고 가을이 있고 추억처럼 사나이가 있습니다。

一九三九, 九,






또 다른 고향
윤동주

고향에 돌아온 날 밤에
내 백골이 따라와 한 방에 누웠다.


어둔 방은 우주로 통하고
하늘에선가 소리처럼 바람이 불어온다.


어둠 속에서 곱게 풍화작용하는
백골을 들여다 보며
눈물 짓는 것이 내가 우는 것이냐
백골이 우는 것이냐
아름다운 혼이 우는 것이냐


지조 높은 개는
밤을 새워 어둠을 짖는다.


어둠을 짖는 개는
나를 쫓는 것일 게다.


가자 가자
쫓기우는 사람처럼 가자.
백골 몰래 아름다운 또 다른 고향에 가자.







쉽게 씨워진 詩
窓밖에 밤비가 속살거려
六疊房은 남의 나라、

詩人이란 슬픈 天命인줄 알면서도
한줄 詩를 적어 볼가、

땀내와 사랑내 포근히 품긴
보내주신 學費封套를 받어

大學 노ー트를 끼고
늙은 敎授의 講義 들으러 간다。

생각해 보면 어린때 동무를
하나、둘、 죄다 잃어 버리고

나는 무얼 바라
나는 다만、홀로 沈澱하는 것일가?

人生은 살기 어렵다는데
詩가 이렇게 쉽게 씨워지는 것은
부끄러운 일이다。

六疊房은 남의 나라、
窓밖에 밤비가 속살거리는데、

등불을 밝혀 어둠을 조곰 내몰고、
時代처럼 올 아침을 기다리는 最後의 나、

나는 나에게 적은 손을 내밀어
눈물과 慰安으로 잡는 最初의 握手。

一九四二年六月三日







또 다른 고향
윤동주

고향에 돌아온 날 밤에
내 백골이 따라와 한 방에 누웠다.


어둔 방은 우주로 통하고
하늘에선가 소리처럼 바람이 불어온다.


어둠 속에서 곱게 풍화작용하는
백골을 들여다 보며
눈물 짓는 것이 내가 우는 것이냐
백골이 우는 것이냐
아름다운 혼이 우는 것이냐


지조 높은 개는
밤을 새워 어둠을 짖는다.


어둠을 짖는 개는
나를 쫓는 것일 게다.


가자 가자
쫓기우는 사람처럼 가자.
백골 몰래 아름다운 또 다른 고향에 가자.







참회록(懺悔錄)
윤동주

파란 녹이 낀 구리거울 속에 

내 얼굴이 남아 있는 것은

어느 왕조의 유물이기에 

이다지도 욕될까.


나는 나의 참회(懺悔)의 글을 한 줄에 줄이자.

---만(滿) 이십사년 일개월을 

무슨 기쁨을 바라 살아왔던가.


내일이나 모레나 그 어느 즐거운 날에

나는 또 한 줄의 참회록을 써야 한다.

---그때 그 젊은 나이에 

왜 그런 부끄런 고백을 했던가.


밤이면 밤마다 나의 거울을 

손바닥으로 발바닥으로 닦아보자.


그러면 어느 운석 밑으로 홀로 걸어가는 

슬픈 사람의 뒷모양이 

거울 속에 나타나 온다.





<십자가>


쫒아오던 햇빛인데

지금 교회당 꼭대기에

십자가에 걸리었습니다

 

尖塔(첨탑)이 저렇게 높은데

어떻게 올라 갈 수 있을까요

 

종소리도 들려오지 않는데

휘파람이나 불며 서성거리다가

 

괴로웠던 사나이

행복한 예수 그리스도에게 처럼

십자가가 허락된다면

 

모가지를 드리우고

꽃처럼 피어나는 피를

어두워가는 하늘 밑에

조용히 흘리겠습니다






<꿈은 깨어지고>

잠은 눈을 떴다

그윽한 幽霧에서


노래하든 종달이
도망쳐 날아나고,
 

지난날 봄타령하든

금잔디 밭은 아니다
 

塔은 무너졌다,

볽은 마음의 塔이

손톱으로 새긴 大理石塔이

하로저녁 暴風에 餘地없이도,


오오 荒廢의 쑥밭,

눈물과 목메임이여!


꿈은 깨어졌다

塔은 무너졌다.







<사랑스런 추억>


봄이 오던 아침,

서울 어느 쪼그만 정거장에서 희망과

사랑처럼 기차를 기다려,

나는 플랫폼에 간신한 그림자를 떨어뜨리고,

담배를 피웠다.

내 그림자는 담배연기 그림자를 날리고,

비둘기 한 떼가 부끄러울 것도 없이

나래 속을 속,속, 햇빛에 비춰 날았다.

기차는 아무 새로운 소식도 없이

나를 멀리 실어다 주어,

봄은 다 가고-

동경 교외 어느 조용한 하숙방에서

옛거리에 남은 나를 희망과 사랑처럼 그리워한다.


오늘도 기차는 몇 번이나 무의미하게 지나가고,

오늘도 나는 누구를 기다려

정거장 가차운 언덕에서 서성거릴 게다.

 
- 아아 젊음은 오래 거기 남아 있거라







 

<소년>

여기저기서 단풍잎 같은 슬픈 가을이

뚝뚝 떨어진다.

단풍잎 떨어져 나온 자리마다

봄을 마련해 놓고

나뭇가지 우에 하늘이 펼쳐져 있다.

가만히 하늘을 들여다보려면

눈썹에 파란 물감이 든다.

두 손으로 따뜻한 볼을 쓸어보면

손바닥에도 파란 물감이 묻어난다.

다시 손바닥을 들여다본다.

손금에는 맑은 강물이 흐르고,

맑은 강물이 흐르고,

강물 속에는 사랑처럼 슬픈 얼굴......

아름다운 순이의 얼굴이 어린다.

소년은 황홀히 눈을 감어 본다.

그래도 맑은 강물은 흘러

사랑처럼 슬픈 순이의 얼굴......

아름다운 순이의 얼굴은 어린다.






<병원(病院)>

 

살구나무 그늘로 얼굴을 가리고, 병원 뒤뜰에 누워,

젊은 여자가 흰 옷 아래로 하얀 다리를 드러내 놓고 일광욕을 한다.

한나절이 기울도록 가슴을 앓는다는 이 여자를 찾아오는 이,

나비 한 마리도 없다.

슬프지도 않은 살구나무 가지에는 바람조차 없다.

 

나도 모를 아픔을 오래 참다 처음으로 이곳에 찾아왔다.

그러나 나의 늙은 의사는 젊은이의 병을 모른다.

나한테는 병이 없다고 한다.

이 지나친 시련,이 지나친 피로, 나는 성내서는 안 된다.

 

여자는 자리에서 일어나 옷깃을 여미고

화단에서 금잔화(金盞花) 한 포기를 따 가슴에 꽂고

병실 안으로 사라진다.

나는 그 여자의 건강이 - 아니 내 건강도 속히 회복되기를 바라며

그가 누웠던 자리에 누워 본다.








<초 한대>

 

초 한대 -

내 방에 품긴 향내를 맡는다.

 

광명의 제단이 무너지기 전

나는 깨끗한 제물을 보았다.

 

염소의 갈비뼈 같은 그의 몸

그의 생명인 심지

 

백옥 같은 눈물과 피를 흘려

불살려 버린다.

 

그리고 책상머리에 아롱거리며

선녀처럼 촛불은 춤을 춘다.

 

매를 본 꿩이 도망하듯이

암흑이 창구멍으로 도망한

나의 방에 품긴

제물의 위대한 향내를 맛보노라.
*/


#include <iostream>
using namespace std;

int main(){
    int a,b;
    cin >> a >> b;
    cout << a-b;
}